const WhoAreWe = () => {
  return (
    <section id='whoAreWe' className='section'>
      <h2 className='section__title'>
        من نحن
        <br />
        WHO ARE WE
      </h2>
      <p className='text-center md:w-4/5 mx-auto text-white/70'>تعد شركة أمواج الدولية للتجارة والمقاولات المحدودة من الشركات الوطنية الرائدة في مجال تنفيذ المشاريع الكهربائية والميكانيكية والتجارة العامة حيث تمتلك خبرة واسعة في تصميم وتنفيذ وصيانة محطات التحويل الكهربائية ذات الجهد العالي والمتوسط والمنخفض.منذ تأسيسها، حرصت الشركة على الالتزام بالتميز والجودة من خلال كوادر هندسية مؤهلة وشراكات مع أبرز المصنعين والاستشاريين العالميين لتقديم حلول متكاملة تلبي متطلبات مشاريع الطاقة والبنية التحتية الحديثة</p>
    </section>
  );
};

export default WhoAreWe;
